public/blog/creating-an-irc-bouncer-with-docker-and-znc/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Creating an Irc Bouncer With Docker and Znc</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <h1>Creating an Irc Bouncer With Docker and Znc</h1>

  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Preface</a>
</li>
<li><a href="#headline-2">Dependencies</a>
</li>
<li><a href="#headline-3">Creating the container</a>
</li>
<li><a href="#headline-4">Logging into the web interface</a>
</li>
<li><a href="#headline-5">Connecting to the bouncer</a>
</li>
<li><a href="#headline-6">Dealing with Nickserv</a>
</li>
<li><a href="#headline-7">Listen on HTTP and HTTPS</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Preface
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>This is a half ass post on setting up ZNC to be your IRC bouncer and
enable automatic login for nickserv required servers. Everything is
going to be done through docker.</p>
<p>
You&#39;ll need a public facing server and about 15 minutes of time.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Dependencies
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>sudo apt install docker docker-io
</span></span><span style="display:flex;"><span>sudo systemctl enable --now docker</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Creating the container
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The first command creates an interactive ZNC container that&#39;s used to
generate the configuration files.  You&#39;ll be prompted to set a port
(i.e 8080), nickname, password, identifier for nickserv, etc. After answering the
prompts select the option to <strong>not</strong> start the server.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>docker run -it -v znc-cfg:/znc-data znc --makeconf</span></span></code></pre></div>
</div>
<p>
Now that the configuration files are created and your user account is
setup, start the ZNC container for real this time.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>docker run --name znc -d --restart always -p 8080:8080 -v znc-cfg:/znc-data znc</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Logging into the web interface
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>With the username and password you setup earlier, log into the web
interface for the ZNC instance using &lt;ip_address&gt;:8080. You don&#39;t have
to do anything in here. There are some plugins that you can enable for
fail2ban, but thats optional.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Connecting to the bouncer
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>With Hexchat, you can connect to it using these credentials</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  Server: &lt;YOUR_ZNC_IP&gt;:8080
</span></span><span style="display:flex;"><span>  Username: &lt;YOUR_ZNC_USER&gt;/&lt;IRC_NETWORK_NAME&gt;
</span></span><span style="display:flex;"><span>  Password: &lt;YOUR_VNC_USER&gt;/&lt;IRC_NETWORK_NAME&gt;:&lt;YOUR_ZNC_PASSWORD&gt;
</span></span><span style="display:flex;"><span>  Login Method: Server Password <span style="color:#f92672">(</span>/PASS password<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>  SSL: Enabled
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  Example:
</span></span><span style="display:flex;"><span>  Username: johndoe/pine64
</span></span><span style="display:flex;"><span>  Password: johndoe/pine64:super_password</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Dealing with Nickserv
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The only problem with the current configuration is that if the IRC
server mandates nickserv registration, none of your IRC chats will be
logged and you&#39;ll have to manually log into nickserv after connecting
to the bouncer.</p>
<p>
The solution is to enable the nickserv module in ZNC, connect to the
bouncer, then set your nickserv credentials using a fancy command.</p>
<p>
First stop the docker container and edit the ZNC configuration file.
In the &#34;&lt;network&gt;&#34; block for your IRC SERVER, add the <code>LoadModule = nickserv</code> line to it</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  docker container stop znc
</span></span><span style="display:flex;"><span>  vim /var/lib/docker/volumes/znc-cfg/_data/configs/znc.conf
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">[</span>...<span style="color:#f92672">]</span>
</span></span><span style="display:flex;"><span>  &lt;Network pine64&gt;
</span></span><span style="display:flex;"><span>    FloodBurst <span style="color:#f92672">=</span> <span style="color:#ae81ff">9</span>
</span></span><span style="display:flex;"><span>    FloodRate <span style="color:#f92672">=</span> 2.00
</span></span><span style="display:flex;"><span>    IRCConnectEnabled <span style="color:#f92672">=</span> true
</span></span><span style="display:flex;"><span>    JoinDelay <span style="color:#f92672">=</span> <span style="color:#ae81ff">0</span>
</span></span><span style="display:flex;"><span>    LoadModule <span style="color:#f92672">=</span> simple_away
</span></span><span style="display:flex;"><span>    LoadModule <span style="color:#f92672">=</span> nickserv
</span></span><span style="display:flex;"><span>    Server <span style="color:#f92672">=</span> irc.pine64.org +6697
</span></span><span style="display:flex;"><span>    TrustAllCerts <span style="color:#f92672">=</span> false
</span></span><span style="display:flex;"><span>    TrustPKI <span style="color:#f92672">=</span> true
</span></span><span style="display:flex;"><span>    &lt;Chan <span style="color:#75715e">#pine64&gt;</span>
</span></span><span style="display:flex;"><span>    &lt;/Chan&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;Chan <span style="color:#75715e">#pinebook&gt;</span>
</span></span><span style="display:flex;"><span>    &lt;/Chan&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;Chan <span style="color:#75715e">#pinephone&gt;</span>
</span></span><span style="display:flex;"><span>    &lt;/Chan&gt;
</span></span><span style="display:flex;"><span>  &lt;/Network&gt;
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">[</span>...<span style="color:#f92672">]</span></span></span></code></pre></div>
</div>
<p>
Now start the container again</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>docker container start znc</span></span></code></pre></div>
</div>
<p>
When the container starts back up, log into your znc irc server and
run this command once you&#39;re connected to the server.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  /msg *nickserv set &lt;YOUR_SUPER_SECRET_PASSWORD&gt;</span></span></code></pre></div>
</div>
<p>
That&#39;s all you have to do. Now your nickserv identity will
automatically be verified when loggin into the ZNC server.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Listen on HTTP and HTTPS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Edit /var/lib/docker/volumes/znc-cfg/_data/configs/znc.conf</p>
<p>
Add a new directive for another listener. It should look like this</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>  &lt;Listener listener0&gt;
</span></span><span style="display:flex;"><span>        AllowIRC = true
</span></span><span style="display:flex;"><span>        AllowWeb = true
</span></span><span style="display:flex;"><span>        IPv4 = true
</span></span><span style="display:flex;"><span>        IPv6 = true
</span></span><span style="display:flex;"><span>        Port = 8080
</span></span><span style="display:flex;"><span>        SSL = true
</span></span><span style="display:flex;"><span>        URIPrefix = /
</span></span><span style="display:flex;"><span>&lt;/Listener&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>&lt;Listener listener1&gt;
</span></span><span style="display:flex;"><span>        AllowIRC = true
</span></span><span style="display:flex;"><span>        AllowWeb = false
</span></span><span style="display:flex;"><span>        IPv4 = true
</span></span><span style="display:flex;"><span>        IPv6 = true
</span></span><span style="display:flex;"><span>        Port = 8081
</span></span><span style="display:flex;"><span>        SSL = false
</span></span><span style="display:flex;"><span>        URIPrefix = /
</span></span><span style="display:flex;"><span>&lt;/Listener&gt;</span></span></code></pre></div>
</div>
<p>
Now recreate your docker container with some additional port forwarding.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>docker run --name znc -d --restart always -p 8080:8080 -p 8081:8081 -v znc-cfg:/znc-data znc</span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
